In [1]:
import pandas as pd
import numpy as np

In [3]:
s=pd.Series([10.5,12.5,14.5,16.5])

In [4]:
print(s)

0    10.5
1    12.5
2    14.5
3    16.5
dtype: float64

Index:contain unique identifiers of entries within a datafram or seriers

In [16]:
m=pd.Series([10.5,12.5,14.5,16.5],name="height")

In [17]:
print(m)

0    10.5
1    12.5
2    14.5
3    16.5
Name: height, dtype: float64

In [18]:
m.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
n=pd.Series([10.5,12.5,14.5,16.5],name="height",index =['a','b','c','d'])

In [8]:
print(n)

a    10.5
b    12.5
c    14.5
d    16.5
Name: height, dtype: float64

In [12]:
o=n=pd.Series([10.5,12.5,14.5,16.5],name="height",index =['a','b','c','d'])

In [13]:
print(o)

a    10.5
b    12.5
c    14.5
d    16.5
Name: height, dtype: float64

In [14]:
o.values

array([10.5, 12.5, 14.5, 16.5])

In [15]:
o.index

Index(['a', 'b', 'c', 'd'], dtype='object')

From dictionaries

In [19]:
population={"Nairobi":150000,"Mombasa":250000,"Kitale":100000}

In [20]:
type(population)

dict

In [21]:
pop=pd.Series(population)

In [22]:
pop

Nairobi    150000
Mombasa    250000
Kitale     100000
dtype: int64

In [23]:
pop.index

Index(['Nairobi', 'Mombasa', 'Kitale'], dtype='object')

In [24]:
pop.values

array([150000, 250000, 100000])

DataFrame

In [25]:
population

{'Nairobi': 150000, 'Mombasa': 250000, 'Kitale': 100000}

In [26]:
area={"Nairobi":200,"Mombasa":550,"Kitale":130}

In [27]:
area

{'Nairobi': 200, 'Mombasa': 550, 'Kitale': 130}

In [28]:
regions=pd.DataFrame({"pop":population,"cubic_metres":area})

In [29]:
print(regions)

            pop  cubic_metres
Nairobi  150000           200
Mombasa  250000           550
Kitale   100000           130

In [35]:
pd.__version__

'2.3.2'

In [30]:
regions.index

Index(['Nairobi', 'Mombasa', 'Kitale'], dtype='object')

In [2]:
data = {"Name":["Annex","Simba","Peter"],
        "Module":["Python","Pydata","Machine Learning"],
        "Score":[80,90,75]}

In [3]:
df=pd.DataFrame(data)
print(df)

    Name            Module  Score
0  Annex            Python     80
1  Simba            Pydata     90
2  Peter  Machine Learning     75

In [4]:
df

    Name            Module  Score
0  Annex            Python     80
1  Simba            Pydata     90
2  Peter  Machine Learning     75

Basic Exploration

In [5]:
df.head(2)

    Name  Module  Score
0  Annex  Python     80
1  Simba  Pydata     90

In [6]:
df.tail(2)

    Name            Module  Score
1  Simba            Pydata     90
2  Peter  Machine Learning     75

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Module  3 non-null      object
 2   Score   3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [9]:
df.describe()

           Score
count   3.000000
mean   81.666667
std     7.637626
min    75.000000
25%    77.500000
50%    80.000000
75%    85.000000
max    90.000000

In [10]:
df.shape

(3, 3)

In [11]:
df.columns

Index(['Name', 'Module', 'Score'], dtype='object')

In [12]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [13]:
df.dtypes

Name      object
Module    object
Score      int64
dtype: object

Indexing and Selection

In [14]:
df

    Name            Module  Score
0  Annex            Python     80
1  Simba            Pydata     90
2  Peter  Machine Learning     75

In [15]:
df["Name"]

0    Annex
1    Simba
2    Peter
Name: Name, dtype: object

In [ ]:
#two or more columns
df[["Name","Score"]]

    Name  Score
0  Annex     80
1  Simba     90
2  Peter     75

In [ ]:
#iloc

In [17]:
df

    Name            Module  Score
0  Annex            Python     80
1  Simba            Pydata     90
2  Peter  Machine Learning     75

In [18]:
df.iloc[0]  #first row

Name       Annex
Module    Python
Score         80
Name: 0, dtype: object

In [19]:
df.iloc[0:2]  #first two rows

    Name  Module  Score
0  Annex  Python     80
1  Simba  Pydata     90

In [20]:
df.iloc[0:2,0:2]  #first two rows and first two columns

    Name  Module
0  Annex  Python
1  Simba  Pydata

In [ ]:
#loc